# Даны 2 целых числа a и b, проверить истиность что a b имеют одинаковую четность

a = int (input ("Введите 1е число >>"))
b = int (input ("Введите 2е число >>"))


if (a%2 == b%2): print ("OK")
else :print ("Break")


